zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samc20n-pinctrl.h
/* pb20d_sercom2_pad0 */
#define PB20D_SERCOM2_PAD0 \
	SAM_PINMUX(b, 20, d, periph)

/* pb20h_gclk_io6 */
#define PB20H_GCLK_IO6 \
	SAM_PINMUX(b, 20, h, periph)

/* pb21_gpio */
#define PB21_GPIO \
	SAM_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 \
	SAM_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 \
	SAM_PINMUX(b, 21, c, periph)

/* pb21d_sercom2_pad2 */
#define PB21D_SERCOM2_PAD2 \
	SAM_PINMUX(b, 21, d, periph)

/* pb21h_gclk_io7 */
#define PB21H_GCLK_IO7 \
	SAM_PINMUX(b, 21, h, periph)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	SAM_PINMUX(b, 22, a, periph)

/* pb22c_sercom0_pad2 */
#define PB22C_SERCOM0_PAD2 \
	SAM_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 \
	SAM_PINMUX(b, 22, e, periph)

/* pb22f_tcc1_wo2 */
#define PB22F_TCC1_WO2 \
	SAM_PINMUX(b, 22, f, periph)

/* pb22h_gclk_io0 */
#define PB22H_GCLK_IO0 \
	SAM_PINMUX(b, 22, h, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	SAM_PINMUX(b, 23, a, periph)

/* pb23c_sercom0_pad3 */
#define PB23C_SERCOM0_PAD3 \
	SAM_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 \
	SAM_PINMUX(b, 23, e, periph)

/* pb23f_tcc1_wo3 */
#define PB23F_TCC1_WO3 \
	SAM_PINMUX(b, 23, f, periph)

/* pb23h_gclk_io1 */
#define PB23H_GCLK_IO1 \
	SAM_PINMUX(b, 23, h, periph)

/* pb24_gpio */
#define PB24_GPIO \
	SAM_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint7 */
#define PB24A_EIC_EXTINT7 \
	SAM_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 \
	SAM_PINMUX(b, 24, c, periph)

/* pb24d_sercom4_pad0 */
#define PB24D_SERCOM4_PAD0 \
	SAM_PINMUX(b, 24, d, periph)

/* pb24h_ac_cmp0 */
#define PB24H_AC_CMP0 \
	SAM_PINMUX(b, 24, h, periph)

/* pb25_gpio */
#define PB25_GPIO \
	SAM_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint8 */
#define PB25A_EIC_EXTINT8 \
	SAM_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 \
	SAM_PINMUX(b, 25, c, periph)

/* pb25d_sercom4_pad1 */
#define PB25D_SERCOM4_PAD1 \
	SAM_PINMUX(b, 25, d, periph)

/* pb25h_ac_cmp1 */
#define PB25H_AC_CMP1 \
	SAM_PINMUX(b, 25, h, periph)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	SAM_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad0 */
#define PB30D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 \
	SAM_PINMUX(b, 30, e, periph)

/* pb30h_ac_cmp2 */
#define PB30H_AC_CMP2 \
	SAM_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	SAM_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad1 */
#define PB31D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 \
	SAM_PINMUX(b, 31, e, periph)

/* pb31h_ac_cmp3 */
#define PB31H_AC_CMP3 \
	SAM_PINMUX(b, 31, h, periph)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint8 */
#define PC0A_EIC_EXTINT8 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_adc0_ain8 */
#define PC0B_ADC0_AIN8 \
	SAM_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint9 */
#define PC1A_EIC_EXTINT9 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_adc0_ain9 */
#define PC1B_ADC0_AIN9 \
	SAM_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint10 */
#define PC2A_EIC_EXTINT10 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_adc0_ain10 */
#define PC2B_ADC0_AIN10 \
	SAM_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint11 */
#define PC3A_EIC_EXTINT11 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_adc0_ain11 */
#define PC3B_ADC0_AIN11 \
	SAM_PINMUX(c, 3, b, periph)

/* pc3c_sercom7_pad0 */
#define PC3C_SERCOM7_PAD0 \
	SAM_PINMUX(c, 3, c, periph)

/* pc3f_tcc2_wo0 */
#define PC3F_TCC2_WO0 \
	SAM_PINMUX(c, 3, f, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint13 */
#define PC5A_EIC_EXTINT13 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5c_sercom6_pad3 */
#define PC5C_SERCOM6_PAD3 \
	SAM_PINMUX(c, 5, c, periph)

/* pc5f_tcc2_wo1 */
#define PC5F_TCC2_WO1 \
	SAM_PINMUX(c, 5, f, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint14 */
#define PC6A_EIC_EXTINT14 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6c_sercom6_pad0 */
#define PC6C_SERCOM6_PAD0 \
	SAM_PINMUX(c, 6, c, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint15 */
#define PC7A_EIC_EXTINT15 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7c_sercom6_pad1 */
#define PC7C_SERCOM6_PAD1 \
	SAM_PINMUX(c, 7, c, periph)

/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_eic_extint0 */
#define PC8A_EIC_EXTINT0 \
	SAM_PINMUX(c, 8, a, periph)

/* pc8c_sercom6_pad0 */
#define PC8C_SERCOM6_PAD0 \
	SAM_PINMUX(c, 8, c, periph)

/* pc8d_sercom7_pad0 */
#define PC8D_SERCOM7_PAD0 \
	SAM_PINMUX(c, 8, d, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_eic_extint1 */
#define PC9A_EIC_EXTINT1 \
	SAM_PINMUX(c, 9, a, periph)

/* pc9c_sercom6_pad1 */
#define PC9C_SERCOM6_PAD1 \
	SAM_PINMUX(c, 9, c, periph)

/* pc9d_sercom7_pad1 */
#define PC9D_SERCOM7_PAD1 \
	SAM_PINMUX(c, 9, d, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint2 */
#define PC10A_EIC_EXTINT2 \
	SAM_PINMUX(c, 10, a, periph)

/* pc10c_sercom6_pad2 */
#define PC10C_SERCOM6_PAD2 \
	SAM_PINMUX(c, 10, c, periph)

/* pc10d_sercom7_pad2 */
#define PC10D_SERCOM7_PAD2 \
	SAM_PINMUX(c, 10, d, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

