zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samc20n-pinctrl.h
/* pc11a_eic_extint3 */
#define PC11A_EIC_EXTINT3 \
	SAM_PINMUX(c, 11, a, periph)

/* pc11c_sercom6_pad3 */
#define PC11C_SERCOM6_PAD3 \
	SAM_PINMUX(c, 11, c, periph)

/* pc11d_sercom7_pad3 */
#define PC11D_SERCOM7_PAD3 \
	SAM_PINMUX(c, 11, d, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint4 */
#define PC12A_EIC_EXTINT4 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12c_sercom7_pad0 */
#define PC12C_SERCOM7_PAD0 \
	SAM_PINMUX(c, 12, c, periph)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint5 */
#define PC13A_EIC_EXTINT5 \
	SAM_PINMUX(c, 13, a, periph)

/* pc13c_sercom7_pad1 */
#define PC13C_SERCOM7_PAD1 \
	SAM_PINMUX(c, 13, c, periph)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint6 */
#define PC14A_EIC_EXTINT6 \
	SAM_PINMUX(c, 14, a, periph)

/* pc14c_sercom7_pad2 */
#define PC14C_SERCOM7_PAD2 \
	SAM_PINMUX(c, 14, c, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint7 */
#define PC15A_EIC_EXTINT7 \
	SAM_PINMUX(c, 15, a, periph)

/* pc15c_sercom7_pad3 */
#define PC15C_SERCOM7_PAD3 \
	SAM_PINMUX(c, 15, c, periph)

/* pc16_gpio */
#define PC16_GPIO \
	SAM_PINMUX(c, 16, gpio, gpio)

/* pc16a_eic_extint8 */
#define PC16A_EIC_EXTINT8 \
	SAM_PINMUX(c, 16, a, periph)

/* pc16c_sercom6_pad0 */
#define PC16C_SERCOM6_PAD0 \
	SAM_PINMUX(c, 16, c, periph)

/* pc17_gpio */
#define PC17_GPIO \
	SAM_PINMUX(c, 17, gpio, gpio)

/* pc17a_eic_extint9 */
#define PC17A_EIC_EXTINT9 \
	SAM_PINMUX(c, 17, a, periph)

/* pc17c_sercom6_pad1 */
#define PC17C_SERCOM6_PAD1 \
	SAM_PINMUX(c, 17, c, periph)

/* pc18_gpio */
#define PC18_GPIO \
	SAM_PINMUX(c, 18, gpio, gpio)

/* pc18a_eic_extint10 */
#define PC18A_EIC_EXTINT10 \
	SAM_PINMUX(c, 18, a, periph)

/* pc18c_sercom6_pad2 */
#define PC18C_SERCOM6_PAD2 \
	SAM_PINMUX(c, 18, c, periph)

/* pc19_gpio */
#define PC19_GPIO \
	SAM_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint11 */
#define PC19A_EIC_EXTINT11 \
	SAM_PINMUX(c, 19, a, periph)

/* pc19c_sercom6_pad3 */
#define PC19C_SERCOM6_PAD3 \
	SAM_PINMUX(c, 19, c, periph)

/* pc20_gpio */
#define PC20_GPIO \
	SAM_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint12 */
#define PC20A_EIC_EXTINT12 \
	SAM_PINMUX(c, 20, a, periph)

/* pc21_gpio */
#define PC21_GPIO \
	SAM_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint13 */
#define PC21A_EIC_EXTINT13 \
	SAM_PINMUX(c, 21, a, periph)

/* pc24_gpio */
#define PC24_GPIO \
	SAM_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint0 */
#define PC24A_EIC_EXTINT0 \
	SAM_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 \
	SAM_PINMUX(c, 24, c, periph)

/* pc24d_sercom4_pad2 */
#define PC24D_SERCOM4_PAD2 \
	SAM_PINMUX(c, 24, d, periph)

/* pc25_gpio */
#define PC25_GPIO \
	SAM_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint1 */
#define PC25A_EIC_EXTINT1 \
	SAM_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 \
	SAM_PINMUX(c, 25, c, periph)

/* pc25d_sercom4_pad3 */
#define PC25D_SERCOM4_PAD3 \
	SAM_PINMUX(c, 25, d, periph)

/* pc26_gpio */
#define PC26_GPIO \
	SAM_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint2 */
#define PC26A_EIC_EXTINT2 \
	SAM_PINMUX(c, 26, a, periph)

/* pc27_gpio */
#define PC27_GPIO \
	SAM_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint3 */
#define PC27A_EIC_EXTINT3 \
	SAM_PINMUX(c, 27, a, periph)

/* pc27d_sercom1_pad0 */
#define PC27D_SERCOM1_PAD0 \
	SAM_PINMUX(c, 27, d, periph)

/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint4 */
#define PC28A_EIC_EXTINT4 \
	SAM_PINMUX(c, 28, a, periph)

/* pc28d_sercom1_pad1 */
#define PC28D_SERCOM1_PAD1 \
	SAM_PINMUX(c, 28, d, periph)
